{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report mapping three implemented features (dual phone numbers, premium redesign, updated background images) to their associated source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of each frontend source file, describing their roles in the premium redesign including styling, components, and dual phone number CTAs.",
  "frontend/index.css": "Base Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, primary, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the React app titled 'RK Day 2 Day Facilitys' that mounts the app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that assembles the single-page layout by composing Header, Hero, Services, WhyChooseUs, Contact, and Footer in order.",
  "frontend/src/components/Contact.tsx": "Dark teal contact section displaying both phone numbers (99624 42558 and 7358440081) as tappable tel: links with call buttons, business hours, and service area info.",
  "frontend/src/components/Footer.tsx": "Site footer with brand info, quick navigation links, and both phone numbers listed as tappable tel: links with Primary/Alternate labels inside a dark teal layout.",
  "frontend/src/components/Header.tsx": "Sticky responsive header with scroll-aware styling, smooth-scroll navigation including a 'Why Us' link, animated mobile menu, and a desktop call button linking to the primary phone number.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section with animated rotating taglines, background image with gradient overlays, and CTA buttons that scroll to contact/services sections.",
  "frontend/src/components/ServiceCard.tsx": "Reusable card component displaying a cleaning service with icon, title, description, feature list, optional 'Popular' highlight styling, and two phone number CTA links.",
  "frontend/src/components/Services.tsx": "Services section rendering three ServiceCard instances (House Keeping, Deep Cleaning, Grouting) with a section header, background image, and bottom call-to-action links.",
  "frontend/src/components/WhyChooseUs.tsx": "Dark teal section showcasing company stats (500+ clients, 5-star rating, etc.) and a grid of six trust/differentiator cards with icons on a background image overlay.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing DFINITY Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/index.css": "Global CSS file that imports Inter and Playfair Display fonts, sets up Tailwind base/components/utilities, defines CSS custom properties for light/dark themes using oklch colors, and declares reusable component classes and keyframe animations.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider (React Query) and InternetIdentityProvider before mounting to the DOM root.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom oklch-based color palettes (teal, cream, semantic tokens), Inter/Playfair Display fonts, custom shadows, border radii, and animation keyframes, plus tailwindcss-animate, typography, and container-queries plugins.",
  "project_state.json": "Project state metadata file tracking the version, summary, existing features, and image requirements for the RK Day 2 Day Facilitys cleaning services website, including feature IDs and contact details."
}